cf/Documents/ИзменениеКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ИзменениеКонфигурации</Name>
			<BasedOn>
				<xr:Item>Document.Обращение</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзмененияКонфигурации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СутьИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышенныйРиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрБазыДляТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначСписокБаз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обращение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИзмененийКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛюбаяБазаДляТестирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыеОбъекты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
						<v8:Type>cfg:CatalogRef.Функции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРелиза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРелиза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысокаяТрудоёмкостьОтката</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЭлемента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭлементовСтруктурыОбъектаМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементСтруктуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыСтруктурыОбъектаМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйОбъектМетаданных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалениеМетаданных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Релиз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазыТестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Функции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/WebServices/ReleaseInfo/Ext/Module.bsl
Функция GetInfo(ReleaseID)
	
	Релиз = Справочники.Релизы.НайтиПоКоду(ReleaseID);
	
	Если Релиз.Пустая() Тогда
		Возврат NULL;
	Иначе
		Если Релиз.Уровень() > 0 Тогда
			РелизПараметр = Релиз.Родитель;
		Иначе
			РелизПараметр = Релиз;
		КонецЕсли; 
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеКонфигурации.Релиз.Код КАК Релиз,
		|	ИзменениеКонфигурации.Заказчик.ФизЛицо.Наименование КАК Заказчик,
		|	ИзменениеКонфигурации.ДокументОснование.Номер КАК НомерЗаявки,
		|	ВЫРАЗИТЬ(ИзменениеКонфигурации.СутьИзменений КАК СТРОКА(1000)) КАК СутьИзменений
		|ИЗ
		|	Документ.ИзменениеКонфигурации КАК ИзменениеКонфигурации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ИзменениеКонфигурации.Заказчик.ФизЛицо = Сотрудники.ФизЛицо
		|ГДЕ
		|	ИзменениеКонфигурации.Релиз В ИЕРАРХИИ(&Релиз)
		|	И Сотрудники.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзменениеКонфигурации.Заказчик.ФизЛицо.Наименование,
		|	ИзменениеКонфигурации.ДокументОснование.Номер,
		|	ВЫРАЗИТЬ(ИзменениеКонфигурации.СутьИзменений КАК СТРОКА(1000)),
		|	ИзменениеКонфигурации.Релиз.Код
		|ИТОГИ ПО
		|	Релиз,
		|	Заказчик";
	
	Запрос.УстановитьПараметр("Релиз", РелизПараметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРелиз = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ReleaseInfo = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ReleaseInfo", "ReleaseInfo"));
	
	Пока ВыборкаРелиз.Следующий() Цикл
		
		Release = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ReleaseInfo", "Release"));
	    Release.Identity = ВыборкаРелиз.Релиз;
	
		ВыборкаЗаказчик = ВыборкаРелиз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаЗаказчик.Следующий() Цикл
			
			Initiator = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ReleaseInfo", "Initiator"));
		    Initiator.Name = ВыборкаЗаказчик.Заказчик;
	
			ВыборкаДетальныеЗаписи = ВыборкаЗаказчик.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Request = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ReleaseInfo", "Request"));
				Request.RequestNumber = ВыборкаДетальныеЗаписи.НомерЗаявки;
				Request.Description = ВыборкаДетальныеЗаписи.СутьИзменений;
				Initiator.Request.Добавить(Request);
				
			КонецЦикла;
			Release.Initiator.Добавить(Initiator);
		КонецЦикла;
		ReleaseInfo.Release.Добавить(Release);
	КонецЦикла;
	
	Возврат ReleaseInfo;

КонецФункции
